0/freshAir
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      freshAir;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;          // old air = 0
boundaryField
{
    vent
    {
        type            zeroGradient;
    }
    room
    {
        type            zeroGradient;
    }
    doorClosed
    {
        type            zeroGradient;
    }
    door
    {
        type            fixedValue;
        value           uniform 1;  // fresh air = 1
    }
    walls
    {
        type            zeroGradient;
    }
    /*toilet
    {
        type            zeroGradient;
    }*/
    /*human
    {
        type            zeroGradient;
    }
    floor
    {
        type            zeroGradient;
    }
    symmCut
    {
        type            symmetryPlane;
    }*/
}
