0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    walls
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
    doorClosed
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
    vent
    {
        type            zeroGradient;
    }

    door
    {
        type            fixedValue;
        value           uniform 0;  // fixed omega on walls
    }
    room
    {
        type            omegaWallFunction;
        value           uniform 0;
    }

    /*toilet
    {
        type            omegaWallFunction;
        value           uniform 0;
    }*/
    /*human
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
    floor
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
    symmCut
    {
        type            symmetryPlane;
    }*/
}

// ************************************************************************* //
