system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//actions
//(
//    // Vent
//    {
//        name        ventFaces;
//        type        faceSet;
//        action      new;
//        source      boxToFace;
//        sourceInfo
//        {
//            box (0.45  0.173  0.418) (0.54  0.175  0.430);
//        }
//    }
//);
actions
(
    {
        name    wallFaces;
        type    faceSet;
        action  new;
        source  patchToFace;          // faces that belong to a patch
        sourceInfo
        {
            patches ( room );       // ← current wall-patch name
        }
    }

    // Vent
    {
        name        ventFaces;
        type        faceSet;
        action      new;
        source      boxToFace;
        sourceInfo
        {
            // 0.3 × 0.3 vent on ceiling corner
            box (1.7 0.266 2.24999) (1.9 0.466 2.7);
        }
    }

    // Door
    {
        name        doorFaces;
        type        faceSet;
        action      new;
        source      boxToFace;
        sourceInfo
        {
            // Door on x=0 wall
            box (0.0218 -1 0.046) (0.768 0.0001 2.154);
        }
    }
    {
        name    pooCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.2 0.85 0.245) (0.5 1.25 0.255);
        }
    }
    {
        name        doorClosedFaces;
        type        faceSet;
        action      new;
        source      boxToFace;
        sourceInfo
        {
            // Door on x=0 wall
            box (0.0248 -1 0.05) (0.765 0.0001 2.15);
        }
    }
);